const classify = {
  xgb: [
    ['树深度', 'deep', '4', '4', '6', '1'],
    ['列采样率', 'colsample', '0.9', '0.8', '1', '0.1'],
    ['行采样率', 'subsample', '0.9', '0.8', '1', '0.1'],
    ['学习率', 'learnRate', '0.1', '0.05', '0.1', '0.03'],
    ['叶节点最小样本数', 'minSample', '10', '10', '200', '50'],
    ['最大子树棵树', 'ntree', '100', '0.1', '1', '0.4'],
    ['l1正则化系数', 'l1', '0', '0.1', '1', '0.4'],
    ['l2正则化系数', 'l2', '1', '0.1', '1', '0.4']
  ],
  gbdt: [
    ['树深度', 'deep', '4', '4', '6', '1'],
    ['行采样率', 'subsample', '0.9', '0.8', '1', '0.1'],
    ['学习率', 'learnRate', '0.1', '0.05', '0.1', '0.03'],
    ['叶节点最小样本数', 'minSample', '10', '10', '200', '50'],
    ['最大子树棵树', 'ntree', '100', '0.1', '1', '0.4'],
    ['叶子分裂最小增益', 'minInfoGain', '0', '0', '0.5', '0.1']
  ],
  lightgbm: [
    ['树深度', 'deep', '4', '4', '6', '1'],
    ['列采样率', 'colsample', '0.9', '0.8', '1', '0.1'],
    ['行采样率', 'subsample', '0.9', '0.8', '1', '0.1'],
    ['学习率', 'learnRate', '0.1', '0.05', '0.1', '0.03'],
    ['最大子树棵树', 'ntree', '100', '100', '200', '50'],
    ['最大叶节点数', 'maxLeaf', '15', '15', '31', '4'],
    ['叶节点最小海瑟矩阵和', 'minHessian', '0.001', '0.001', '0.1', '0.03']
  ]
}

const regression = {
  linearRegression: [],
  xgb: [
    ['树深度', 'deep', '4'],
    ['列采样率', 'colsample', '0.9'],
    ['行采样率', 'subsample', '0.9'],
    ['学习率', 'learnRate', '0.1'],
    ['叶节点最小样本数', 'minSample', '10'],
    ['最大子树棵树', 'ntree', '100'],
    ['l1正则化系数', 'l1', '0'],
    ['l2正则化系数', 'l2', '1']
  ],
  gbdt: [
    ['树深度', 'deep', '4'],
    ['行采样率', 'subsample', '0.9'],
    ['学习率', 'learnRate', '0.1'],
    ['叶节点最小样本数', 'minSample', '10'],
    ['最大子树棵树', 'ntree', '100'],
    ['叶子分裂最小增益', 'minInfoGain', '0']
  ],
  lightgbm: [
    ['树深度', 'deep', '4'],
    ['列采样率', 'colsample', '0.9'],
    ['行采样率', 'subsample', '0.9'],
    ['学习率', 'learnRate', '0.1'],
    ['最大子树棵树', 'ntree', '100'],
    ['最大叶节点数', 'maxLeaf', '15'],
    ['叶节点最小海瑟矩阵和', 'minHessian', '0.001']
  ]
}

module.exports = {
  classify,
  regression
}
